Revit 2017 API
DirectShape.SetGUIDs Method
 Sets the GUID of the application that has created this DirectShape element and the GUID of the native data that was the source of this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This method will be obsolete in Revit 2017. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties instead.")]
public void SetGUIDs(
	string appGUID,
	string appDataGUID
)
Visual Basic
<ObsoleteAttribute("This method will be obsolete in Revit 2017. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties instead.")> _
Public Sub SetGUIDs ( _
	appGUID As String, _
	appDataGUID As String _
)
Visual C++
[ObsoleteAttribute(L"This method will be obsolete in Revit 2017. Use DirectShape.ApplicationId, DirectShape.ApplicationDataId properties instead.")]
public:
void SetGUIDs(
	String^ appGUID,
	String^ appDataGUID
)
Parameters
appGUID
Type: System.String
 GUID of the application.
appDataGUID
Type: System.String
 GUID of the native data.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DirectShape Class
Autodesk.Revit.DB Namespace